src/Documents/ПоступлениеНаРасчетныйСчет/ПоступлениеНаРасчетныйСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаРасчетныйСчет</name>
  <basedOn>Document.Реализация</basedOn>
  <registerRecords>AccumulationRegister.Покупатели</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccumulationRegister.Банк</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.Статьи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Реализация</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВДоходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ВидыОперацийПоступлениеДенежныхСредств/ВидыОперацийПоступлениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеДенежныхСредств</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОплатаПокупателя</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступление</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеНаСчетМиша</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <registerRecords>AccumulationRegister.Покупатели</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйКонтакт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаениеРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПоступлениеНаРасчетныйСчет/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Основание = Параметры.Основание;
		
		Если ЗначениеЗаполнено(Основание) Тогда // создан на основании
			
			Объект.Основание	= Основание;
			ТекстОснование		= Основание;
			
			Объект.Контрагент 	= Основание.Контрагент;
			Объект.Сумма		= Основание.Сумма;
			
			Объект.ВидОперации	= Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя;
			Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Средства, полученные от покупателей и заказчиков");
			Объект.Счет			= Справочники.Счета.НайтиПоНаименованию("ВТБ-24 ИП", Истина);
			Объект.Валюта		= Объект.Счет.ВалютаДенежныхСредств;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда // Новый, НЕ скопирован

			Объект.ВидОперации	= Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление;
			Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Прочие доходы");
			Объект.Счет			= Справочники.Счета.НайтиПоНаименованию("ВТБ-24 ИП", Истина);
			Объект.Валюта		= Объект.Счет.ВалютаДенежныхСредств;
	
		КонецЕсли; 
		
	КонецЕсли;
	
	ТекстОснование = Объект.Основание;
	
	УправлениеВидимостью();

КонецПроцедуры

&НаСервере
Процедура УправлениеФлагомВключатьВДоходыРасходы()
	
	Объект.НеВключатьВДоходы = Объект.Статья.НеВключатьВДоходы;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.СуммаВал.Видимость 	= (Объект.Валюта.Код <> "643");
	Элементы.Контрагент.Видимость	= (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя);
	
КонецПроцедуры

&НаСервере
Процедура СчетПриИзмененииСервер()
	
	Объект.Валюта = Объект.Счет.ВалютаДенежныхСредств;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	СчетПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВключатьВДоходыРасходы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Ключ", Объект.Основание);
	
	ОткрытьФорму("Документ.Реализация.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВключатьВДоходыРасходы();
	
КонецПроцедуры
